Bancas/2020_Andre/Comentarios.tex
% Created 2020-07-31 sex 18:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[portuguese, english]{babel}
\usepackage[top=2cm, bottom=2cm, left=2cm, right=2cm]{geometry}
\author{Gabriel Petrini da Silveira}
\date{31 de Julho de 2020}
\title{Banca de Monografia - André Novais Gonçalves}
\begin{document}

\maketitle
\tableofcontents



\section{Comentários Gerais}
\label{sec:org52ebe71}
\begin{itemize}
\item \textbf{Método:} Não ficou claro o porquê desta sequência dos capítulos
\begin{itemize}
\item O teórico primeiro poderia justificar o porquê da atenção a algumas variáveis (componentes da demanda)
\end{itemize}
\item \textbf{Estilo:} Adiantar menos a discussão (anti-climax)
\begin{itemize}
\item Isso apareceu um pouco na apresentação
\end{itemize}
\item \textbf{Conteúdo:} Menciona Harrod em vários momentos mas não o discute
\item \textbf{Atenção:} Usa institucionais, estruturais e mudanças como sinônimos.
\item \textbf{Elogio de abertura:} Monografia está muito boa. Destacar que, ao menos quando fiz graduação, poucos tinham interesse em integrar o interesse teórico ao empírico
\end{itemize}

\section{Introdução}
\label{sec:orgab0a571}

\begin{itemize}
\item \textbf{Elogio:} Gostei da contextualização do investimento autônomo a la Cagnin
\item ``O período foi escolhido por conta de apresentar em um espaço relativamente curto de tempo, grandes mudanças no que diz respeito aos elementos que lideraram o crescimento da economia, influenciados diretamente por duas crises geradas por bolhas especulativas.'' (p. 2), que mudanças foram essas?
\item Taxa de investimento, gráfico da apresentação parece um pouco insensível à taxa de crescimento dos demais gastos autônomos
\begin{itemize}
\item Participação do investimento residencial nesse mesmo gráfico se reduz bastante no pré-crise de 2008 (ao longo da bolha)
\end{itemize}
\end{itemize}



\section{Capítulo 1: Fatos Estilizados}
\label{sec:org8fd0e3d}

\begin{itemize}
\item \textbf{Objetivo:} Contextualizar o modelo econométrico
\begin{itemize}
\item Sendo este o caso, não seria interessante ele vir imediatamente antes dele?
\end{itemize}
\item \textbf{Importante:} Não ficou claro o porquê do recorte temporal
\begin{itemize}
\item Critérios econométricos? Início governo Clinton?
\item A própria revisão da literatura indicou que eventos importantes ocorreram antes de 1993 (ex: texto do Serrano e Braga (2006)).
\end{itemize}
\item \textbf{Sugestão:} Não usar gráficos com dois eixos y (e especificar melhor o significado de cada um)
\item \textbf{Solto:} Porém, a falta de instrumentos técnicos de avaliação fundamentalista (p. 6). Detalhar
\item \textbf{Elogio:} Legal incluir as discussões a partir dos documentos do FED
\item \textbf{Elogio:} Narrativa dos fatos estilizados bem amarrada
\begin{itemize}
\item Contexto histórico está bem claro, mas a escolha das variáveis de análise ficam claras depois da revisão da literatura teórica
\begin{itemize}
\item \textbf{Sugestão:} Analisar elementos da demanda (autônomos e induzidos) e investigar a importância dos gastos autônomos após a apresentação do super
\end{itemize}
\end{itemize}
\end{itemize}

\section{Capítulo 2: Revisão teórica}
\label{sec:org3a439d7}
\begin{itemize}
\item \textbf{Apresentação:} Confusão entre característica do equilíbrio do modelo (\(\Delta h = \Delta u = 0\)) e condições de estabilidade
\begin{itemize}
\item Corretamente disse que a taxa de crescimento de \(Z\) é exógena
\end{itemize}
\item \textbf{Elogio:} Tabelas apresentando quais gastos são autônomos, quais são induzidos e quais criam capacidade produtiva
\item \textbf{Atenção:} Gastos autônomos não são necessariamente exógenos
\item \textbf{Conteúdo:} Não há nenhuma menção ao Harrod. Talvez fosse o caso de escrever um parágrafo ao menos.
\item \textbf{Estilo:} A seção 2.2 acaba do nada. Valeria a pena escrever o significado econômico da equação (9)
\item \textbf{Atenção:} Na seção 2.3, é apresentado o modelo SSM com elementos que são de economia fechada também. Talvez seja o caso de apenas reclassificar o que cada seção irá discutir. 2.2: Economia simplificada; 2.3: Economia mais realista
\item \textbf{Atenção:} Na revisão da literatura teórica você não apresentou uma equação para a taxa de crescimento do investimento não-residencial, mas sim para a taxa de investimento da economia.
\begin{itemize}
\item Seguindo Freitas e Serrano (2015, p. 266, Eq (9)): \(g_I = g_t + \gamma\cdot (u-\mu)\)
\item Explicitar que \(g_t\) depende de \(g_Z\)
\item A equação (9) é basicamente a mesma coisa, com a diferença que em uma é a taxa de crescimento do estoque de capital e em outra a taxa de crescimento do investimento (que é o objeto de análise).
\end{itemize}
\item \textbf{Conteúdo:} Seria interessante explicitar algumas hipóteses do modelo SSM, como é o caso da livre mobilidade de capitais
\begin{itemize}
\item Ex: Na página 21, ``evitando assim que haja possível perda de market-share para outras empresas concorrentes.''. Isso ocorre por conta da hipótese mencionada acima.
\end{itemize}
\item \textbf{Elogio:} Pontuou a existência de um \emph{overshooting} do investimento das firmas.
\end{itemize}

\section{Capítulo 3: Modelo econométrico}
\label{sec:org877cef2}
\begin{itemize}
\item \textbf{Visual:} Colocar o valor crítico à direita e estatística do teste à esquerda
\item \textbf{Atenção:} Na revisão de literatura econométrica, houve uma certa confusão entre os testes sobre a taxa de investimento e sobre a taxa de \textbf{crescimento} do investimento (Como em Avancini, Braga e Freitas).
\item \textbf{Metodologia:} Ainda na revisão de literatura, é destacado uma trabalho que parte de 1987. Por que o recorte da monografia é diferente?
\item \textbf{Elogio:} Construção da série do Z. Algo desafiador por si só.
\item \textbf{Elogio:} Tabela que resume modelos econométricos
\item \textbf{Metodologia:} Dado que irá estimar um VAR, os testes de raiz unitária são necessários para certificar que as séries são estacionárias. Logo, trata-se de um procedimento necessário e não de uma \emph{estratégia}.
\begin{itemize}
\item \textbf{Atenção:} \(H_0\) do teste de Zivott-Andrews é: ``/unit root with structural break in the intercept/''
\item \textbf{Atenção:} É usual realizar testes de quebra estrutural
\end{itemize}
\item \textbf{Metodologia:} Não justificou o porquê de um VAR. Por que não um ARIMA? ARDL?
\begin{itemize}
\item Se o teste é se \(g_Z \Rightarrow g_I\), por que o inverso é relevante? Por conta de sua revisão da literatura teórica (espera-se que os gastos sejam autônomos)
\item \textbf{Apresentação:} Como interpretar coeficiente negativo do investimento residencial na equação dos gastos atônomos
\item \textbf{Destacar:} Como as séries são estacionárias, é possível ajustar um VAR
\end{itemize}
\item \textbf{Atenção:} Nas equações do VAR, as variáveis estão sendo representadas em nível, mas os texto diz que são séries em taxa de crescimento (Eq. 16 e 17)
\begin{itemize}
\item Tabela 3.4: Escrever equação 16 e 17 invés de 1 e 2
\end{itemize}
\item \textbf{Metodologia:} Escolha dos \emph{lags} a partir dos critérios de informação é apenas uma ``sugestão''. É comum que os lags sejam escolhidos de acordo com as características dos resíduos.
\item \textbf{Resultado:} Discutir se o sinal dos coeficientes fazem sentido
\item \textbf{Resultado:} Não te chamou atenção os coeficiente do investimento ser quase tão grande quanto do Z?
\item \textbf{Observação:} IRF e FEVD deve ser ortogonalizada ou não-ortogonalizada
\begin{itemize}
\item \href{https://rpubs.com/hudsonchavs/varsvar}{Dicas para ajustamento}
\end{itemize}
\item \textbf{Medotologia:} Mencionar decomposição de Cholesky
\begin{itemize}
\item Mais exógeno primeiro e depois o mais endógeno
\item Alguns autores podem não ter feito esse tipo de ordenamento por que não analisaram a FEVD e o IRF
\item Isso compromete os resultados
\end{itemize}
\item \textbf{Pergunta difícil:} IRF e FEVD indicam o aumento de um desvio-padrão e um único período apenas. A partir do modelo teórico apresentado, esse efeito deve ser temporário ou persistente?
\begin{itemize}
\item MEMO: Dado que é um VAR
\item \textbf{R:} Aumento não é persistente, logo não é para ter um impacto permanente
\end{itemize}
\item \textbf{Pergunta difícil:} A luz da literatura teórica, o que dizer sobre o coeficiente ``autônomo do investimento'' não ser estatisticamente diferente de zero? É esperado dada a revisão de literatura?
\item \textbf{FEVD:} A participação do gi no gz parece ser maior do que no inverso, não? (R: Não)
\item \textbf{Metodologia:} Deu pouca atenção aos resíduos
\begin{itemize}
\item Está no código pelo menos (apenas heterocedasticidade)
\item \textbf{Atenção} Se os resíduos forem autocorrelacionados pode comprometer os resultados
\end{itemize}
\item \textbf{Resultado interessante:} coeficiente associado a taxa de crescimento do investimento não-residencial é nulo.
\item \textbf{Metodologia:} Por que não usou os sub-períodos do capítulo 1 como dummies?
\begin{itemize}
\item Você menciona ``outros testes'' na página 39. Que testes foram esses?
\item Valorizar suas tentativas "fracassadas". Isso continua sendo uma informação relevante.
\end{itemize}
\item \textbf{Apresentação:} Resultado não esperado pode estar associado com decomposição de Cholesky
\begin{itemize}
\item Testar alterando a ordenação e checar se este resultado permanece
\end{itemize}
\end{itemize}

\subsection{Código}
\label{sec:orgdf9bb20}

Uma boa prática é garantir que seu código possua os elementos (pacotes) necessários para a execução e foi feito isso:

\begin{verbatim}
install.packages("lmtest") 
install.packages('tseries') 
install.packages('FinTS')
install.packages("urca") 
install.packages("TTR")
install.packages("pillar")
install.packages("vars")
install.packages("lattice")
\end{verbatim}


Quando disponibilizar o código, é de bom tom distribuir os dados ou incluir no código alguma forma de obtê-los:

\begin{verbatim}
#############leitura dos dados
####Gastos Autônomos
gastos_usa=ts(PIB_Trimestre_Anterior[,2], start=c(1993,1), 
freq=1 # Dúvida: Não deveria ser lag 4? (Dados trimestrais)
)

inv_usa=ts(PIB_Trimestre_Anterior[,3], start=c(1993,1), freq=1)

\end{verbatim}



Quando cria a matriz com os dados, a ordenação é relevante. Decomposição de Cholesky: Mais exógeno primeiro e depois os mais endógenos

\begin{verbatim}
#compactar dados em uma unica matriz PARA OS DADOS ORIGINAIS
dados1 = cbind(inv_usa, gastos_usa)
\end{verbatim}


Em alguns casos, é interessante criar funções para evitar erros:

\begin{verbatim}
################################ ESTIMAÇÃO GRANGER CAUSALITY (x ~ y) -> y granger-causa x
#Rejeitar H0 significa que y granger-causa x
#I original / Z original
grangertest(gastos_usa ~ inv_usa, order = 1) 
grangertest(gastos_usa ~ inv_usa, order = 2)
grangertest(gastos_usa ~ inv_usa, order = 3)
grangertest(gastos_usa ~ inv_usa, order = 4)
grangertest(gastos_usa ~ inv_usa, order = 5)
grangertest(gastos_usa ~ inv_usa, order = 6)
grangertest(gastos_usa ~ inv_usa, order = 7)
grangertest(gastos_usa ~ inv_usa, order = 8)
grangertest(gastos_usa ~ inv_usa, order = 9)
grangertest(gastos_usa ~ inv_usa, order = 10)
grangertest(inv_usa ~ gastos_usa, order = 1) 
grangertest(inv_usa ~ gastos_usa, order = 2)
grangertest(inv_usa ~ gastos_usa, order = 3)
grangertest(inv_usa ~ gastos_usa, order = 4)
grangertest(inv_usa ~ gastos_usa, order = 5)
grangertest(inv_usa ~ gastos_usa, order = 6)
grangertest(inv_usa ~ gastos_usa, order = 7)
grangertest(inv_usa ~ gastos_usa, order = 8)
grangertest(inv_usa ~ gastos_usa, order = 9)
grangertest(inv_usa ~ gastos_usa, order = 10)
\end{verbatim}

Este é um caso em que a ordenação de Cholesky importa:

\begin{verbatim}
################################ FUNÇÃO IMPULSO-RESPOSTA

plot(irf(Z_I1, impulse = 'gastos_usa', response='inv_usa', n.ahead = 10, ci = 0.95))
plot(irf(Z_I2, impulse = 'dgastos1', response='inv_usa', n.ahead = 10, ci = 0.95))
plot(irf(Z_I3, impulse = 'gastos_usa', response='dinv1', n.ahead = 10, ci = 0.95))
plot(irf(Z_I4, impulse = 'dgastos1', response='dinv1', n.ahead = 10, ci = 0.95))

plot(irf(Z_I1, impulse = 'inv_usa', response='gastos_usa', n.ahead = 10, ci = 0.95))
plot(irf(Z_I2, impulse = 'inv_usa', response='dgastos1', n.ahead = 10, ci = 0.95))
plot(irf(Z_I3, impulse = 'dinv1', response='gastos_usa', n.ahead = 10, ci = 0.95))
plot(irf(Z_I4, impulse = 'dinv1', response='dgastos1', n.ahead = 10, ci = 0.95))

plot(irf(Z_I1, impulse = 'gastos_usa', response='gastos_usa', n.ahead = 10, ci = 0.95))
plot(irf(Z_I1, impulse = 'inv_usa', response='inv_usa', n.ahead = 10, ci = 0.95))

################################ DECOMPOSIÇÃO DA VARIANCIA

fevd(Z_I1, n.ahead = 20)
fevd(Z_I2, n.ahead = 10)
fevd(Z_I3, n.ahead = 10)
fevd(Z_I4, n.ahead = 10)
\end{verbatim}


Em relação à inspeção dos resíduos, corretamente foi realizado teste para heterocedasticidade condicional.
No entanto, poderia ter realizado alguns testes de autocorrelação serial com os de Ljung-Box e Box-Pierce, entre outros. 
A presença de autocorrelação dos resíduos pode tornar os parâmetros estimados bastante enviesado de modo que podem inviabilizar sua interpretação:

\begin{verbatim}
################################ INSPEÇÃO DOS RESÍDUOS
#Teste de Heterocedasticidade
ArchTest(inv_usa, lag=25) # Teste ARCH - Teste p/ heteroc. condicional
ArchTest(gastos_usa, lag=25)
\end{verbatim}


\section{Conclusão}
\label{sec:orgd17d742}


\begin{itemize}
\item \textbf{Metodologia:} Mais uma vez, na conclusão é destacado o uso de um recorte temporal distinto, mas não é especificado o porquê desta escolha
\item \textbf{Dúvida:} O que quer dizer por robustez? Normalmente, usa-se robustez para indicar que determinado resultado é insensível à forma de ajustamento (vários \emph{lags} e métodos)
\end{itemize}
\end{document}
